In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

# merge() 

- 合并拥有相同 column name 和 column value 的 DataFrame 数据

- 参数说明：

    - on : 选择参照列合并
        
        - 默认值： None
        
        - 非默认值：以 on 参数的值为基准合并，且这个参数在各个 DataFrame 中都存在
        
    - how : 如何连接，与 数据库连接方式类似
        
        - left : 左连接，将左边表所有参照列的数据打印；右边表如果值存在的话，打印出，否则 打印 NaN
        
        - right : 右连接,将右边表所有参照列的数据打印；左边表如果值存在的话，打印出，否则 打印 NaN
   
        - outer : 外连接，将两表所有的参照列的数据打印，然后补全，存在的打印原来的值，否则打印 NaN
        
        - inner : 内来接，默认值

### merge 官方文档

In [37]:
import webbrowser
webbrowser.open('https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.merge.html?highlight=merge')

True

### 例子1

In [8]:
# create a df1 DataFrame
df1 = DataFrame({'data_set_1':[1,2,3],'key':['X','Y','Z']})
df1

   data_set_1 key
0           1   X
1           2   Y
2           3   Z

In [10]:
# create a df2 DataFrame
df2 = DataFrame({'data_set_2':[4,5,6],'key':['X','B','C']})
df2

   data_set_2 key
0           4   X
1           5   B
2           6   C

In [11]:
pd.merge(df1,df2)

   data_set_1 key  data_set_2
0           1   X           4

### 例子2

In [17]:
# create a df1 DataFrame
df3 = DataFrame({'data_set_3':[1,2,3,4],'key':['X','Y','Z','X']})
df3

   data_set_3 key
0           1   X
1           2   Y
2           3   Z
3           4   X

In [18]:
df2

   data_set_2 key
0           4   X
1           5   B
2           6   C

In [19]:
pd.merge(df2,df3)

   data_set_2 key  data_set_3
0           4   X           1
1           4   X           4

### 参数 on 说明

In [21]:
pd.merge(df2,df3,on=None)

   data_set_2 key  data_set_3
0           4   X           1
1           4   X           4

In [20]:
# key 存在于 df3 和 df2 中，所以可以 以 key 为基准 合并 df2,df3
pd.merge(df2,df3,on='key')

   data_set_2 key  data_set_3
0           4   X           1
1           4   X           4

In [25]:
# data_set_2 不存在于 df3，所以不能 以 data_set_2 为基准 合并 df2,df3
pd.merge(df2,df3,on='data_set_2')

KeyError: 'data_set_2'

### how

In [34]:
df2

   data_set_2 key
0           4   X
1           5   B
2           6   C

In [35]:
df3

   data_set_3 key
0           1   X
1           2   Y
2           3   Z
3           4   X

In [36]:
# 以 key 为基准，做内连接
pd.merge(df2,df3,on='key',how='inner')

   data_set_2 key  data_set_3
0           4   X           1
1           4   X           4

In [29]:
# 以 key 为基准，做左连接
pd.merge(df2,df3,on='key',how='left')

   data_set_2 key  data_set_3
0           4   X         1.0
1           4   X         4.0
2           5   B         NaN
3           6   C         NaN

In [31]:
# 以 key 为基准，做右连接
pd.merge(df2,df3,on='key',how='right')

   data_set_2 key  data_set_3
0         4.0   X           1
1         4.0   X           4
2         NaN   Y           2
3         NaN   Z           3

In [33]:
# 以 key 为基准，做外连接
pd.merge(df2,df3,on='key',how='outer')

   data_set_2 key  data_set_3
0         4.0   X         1.0
1         4.0   X         4.0
2         5.0   B         NaN
3         6.0   C         NaN
4         NaN   Y         2.0
5         NaN   Z         3.0